

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.СвойствоСтрокаИмя      = "КлючСтрока";
	Объект.СвойствоСтрокаЗначение = "Кошка";
	
	Объект.СвойствоЧислоИмя      = "КлючЧисло";
	Объект.СвойствоЧислоЗначение = 123.45;
	
	Объект.СвойствоДатаИмя      = "КлючДата";
	Объект.СвойствоДатаЗначение = '20190801000000';	
	
	Объект.СвойствоБулевоИмя      = "КлючБулево";
	Объект.СвойствоБулевоЗначение = Истина;;
	
	Объект.СвойствоСтруктураИмя = "КлючСтруктура";
	
	СоставОчиститьНаСервере();
	
	НовСтрока = Объект.Состав.Добавить();
	
	НовСтрока.ПризнакОп = Истина;
	НовСтрока.НомерОп = "ПР001";
	НовСтрока.ДатаОп  = '20190801000000';
	НовСтрока.СуммаОп = 98765432; 

//	НовСтрока.ПризнакОп = Истина;
//	НовСтрока.НомерОп = "ПР002";
//	НовСтрока.ДатаОп  = '20190802000000';
//	НовСтрока.СуммаОп = 100100;

	//добавить
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСтруктуру(Команда)
	СформироватьСтруктуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруНаСервере()
	//
	СтрукЗначение = Новый Структура();
	СтрукЗначение.Вставить(Объект.СвойствоСтрокаИмя, Объект.СвойствоСтрокаЗначение);
	СтрукЗначение.Вставить(Объект.СвойствоЧислоИмя, Объект.СвойствоЧислоЗначение);
	СтрукЗначение.Вставить(Объект.СвойствоДатаИмя, Объект.СвойствоДатаЗначение);
		
	СтрЗначение = СтруктураВСтрокуJSON(СтрукЗначение);
	
	СтрокаJSONВСтруктуру(СтрЗначение);

КонецПроцедуры

&НаСервере
Функция СтруктураВСтрокуJSON(Значение)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Для каждого ЭлементСтруктуры Из Значение Цикл
		Если ПустаяСтрока(ЭлементСтруктуры.Значение) И ЭлементСтруктуры.Ключ <> "" Тогда
			// Преобразуем неопределено, NULL и незначащие символы в пустую строку.
			Значение[ЭлементСтруктуры.Ключ] = "";
		ИначеЕсли ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Массив") Тогда
			
			Для каждого ВложенныйЭлемент Из ЭлементСтруктуры.Значение Цикл
				Если ПустаяСтрока(ВложенныйЭлемент.Значение) И ВложенныйЭлемент.Ключ <> "" Тогда
					ВложенныйЭлемент.Ключ = "";
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	ЗаписатьJSON(ЗаписьJSON, Значение);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

&НаСервере
Функция СтрокаJSONВСтруктуру(Значение)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	
	Результат = ПрочитатьJSON(ЧтениеJSON);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура СоставОчистить(Команда)
	СоставОчиститьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоставОчиститьНаСервере()
	Если Объект.Состав.Количество() > 0 Тогда
		Объект.Состав.Очистить();
	КонецЕсли;
	
КонецПроцедуры
